HorseMa/uClinux-STM32/uClinux-dist/linux-2.6.x/include/asm-arm/arch-lpc28xx/lpc28xx.h

#ifndef __ASM_ARCH_LPC28XX_H
#define __ASM_ARCH_LPC28XX_H

/* System Control */
#define SYS_BOOTMAP	(*((volatile unsigned int *) 0x80005070))
#define SYS_BOOTADDR	(*((volatile unsigned int *) 0x80005074))

/* Cache/ Memory Map */
#define CACHE_RST_STAT   (*((volatile unsigned int *) 0x80104000))
#define CACHE_SETTINGS   (*((volatile unsigned int *) 0x80104004))
#define CACHE_PAGE_CTRL  (*((volatile unsigned int *) 0x80104008))
#define C_RD_MISSES	 (*((volatile unsigned int *) 0x8010400C))
#define C_FLUSHES	 (*((volatile unsigned int *) 0x80104010))
#define C_WR_MISSES	 (*((volatile unsigned int *) 0x80104014))
#define ADDRESS_PAGE_0   (*((volatile unsigned int *) 0x80104018))
#define ADDRESS_PAGE_1   (*((volatile unsigned int *) 0x8010401C))
#define ADDRESS_PAGE_2   (*((volatile unsigned int *) 0x80104020))
#define ADDRESS_PAGE_3   (*((volatile unsigned int *) 0x80104024))
#define ADDRESS_PAGE_4   (*((volatile unsigned int *) 0x80104028))
#define ADDRESS_PAGE_5   (*((volatile unsigned int *) 0x8010402C))
#define ADDRESS_PAGE_6   (*((volatile unsigned int *) 0x80104030))
#define ADDRESS_PAGE_7   (*((volatile unsigned int *) 0x80104034))
#define ADDRESS_PAGE_8   (*((volatile unsigned int *) 0x80104038))
#define ADDRESS_PAGE_9   (*((volatile unsigned int *) 0x8010403C))
#define ADDRESS_PAGE_10  (*((volatile unsigned int *) 0x80104040))
#define ADDRESS_PAGE_11  (*((volatile unsigned int *) 0x80104044))
#define ADDRESS_PAGE_12  (*((volatile unsigned int *) 0x80104048))
#define ADDRESS_PAGE_13  (*((volatile unsigned int *) 0x8010404C))
#define ADDRESS_PAGE_14  (*((volatile unsigned int *) 0x80104050))
#define ADDRESS_PAGE_15  (*((volatile unsigned int *) 0x80104054))
#define CPU_CLK_GATE	 (*((volatile unsigned int *) 0x80104058))

/* Flash Memory Controller */
#define F_CTRL	 	 (*((volatile unsigned int *) 0x80102000))
#define F_STAT		 (*((volatile unsigned int *) 0x80102004))
#define F_PROG_TIME	 (*((volatile unsigned int *) 0x80102008))
#define F_WAIT	 	 (*((volatile unsigned int *) 0x80102010))
#define F_CLK_TIME	 (*((volatile unsigned int *) 0x8010201C))
#define F_INTEN_CLR	 (*((volatile unsigned int *) 0x80102FD8))
#define F_INTEN_SET	 (*((volatile unsigned int *) 0x80102FDC))
#define F_INT_STAT	 (*((volatile unsigned int *) 0x80102FE0))
#define F_INTEN	 	 (*((volatile unsigned int *) 0x80102FE4))
#define F_INT_CLR	 (*((volatile unsigned int *) 0x80102FE8))
#define F_INT_SET	 (*((volatile unsigned int *) 0x80102FEC))
#define FLASH_PD	 (*((volatile unsigned int *) 0x80005030))
#define FLASH_INIT	 (*((volatile unsigned int *) 0x80005034))

/* DC-DC Converter */
#define DCDCADJUST1	 (*((volatile unsigned int *) 0x80005004))
#define DCDCADJUST2	 (*((volatile unsigned int *) 0x80005008))
#define DCDCCLKSEL   (*((volatile unsigned int *) 0x8000500C))

/* ------- Clock Generation Unit ------- */

/* CGU Configuration */
#define PMODE   	(*((volatile unsigned int *) 0x80004C00))
#define WDBARK  	(*((volatile unsigned int *) 0x80004C04))
#define OSC32EN     	(*((volatile unsigned int *) 0x80004C08))
#define OSCEN	    	(*((volatile unsigned int *) 0x80004C10))

/* Main PLL */
#define LPFIN 	  	  (*((volatile unsigned int *) 0x80004CE4))
#define LPPDN		  (*((volatile unsigned int *) 0x80004CE8))
#define LPBYPASS	  (*((volatile unsigned int *) 0x80004CEC))
#define LPLOCK		  (*((volatile unsigned int *) 0x80004CF0))
#define LPDIRECT	  (*((volatile unsigned int *) 0x80004CF4))
#define LPMSEL		  (*((volatile unsigned int *) 0x80004CF8))
#define LPPSEL		  (*((volatile unsigned int *) 0x80004CFC))

/* High Speed PLL */
#define HPFIN 	  	  (*((volatile unsigned int *) 0x80004CAC))
#define HPNDEC 	  	  (*((volatile unsigned int *) 0x80004CB4))
#define HPMDEC 	  	  (*((volatile unsigned int *) 0x80004CB0))
#define HPPDEC	  	  (*((volatile unsigned int *) 0x80004CB8))
#define HPMODE 	  	  (*((volatile unsigned int *) 0x80004CBC))
#define HPSTAT	  	  (*((volatile unsigned int *) 0x80004CC0))
#define HPREQ 	  	  (*((volatile unsigned int *) 0x80004CC8))
#define HPACK 	  	  (*((volatile unsigned int *) 0x80004CC4))
#define HPSELR	  	  (*((volatile unsigned int *) 0x80004CD8))
#define HPSELI 	  	  (*((volatile unsigned int *) 0x80004CDC))
#define HPSELP	  	  (*((volatile unsigned int *) 0x80004CE0))

/* Selection Stage */
#define SYSSCR 	  	  (*((volatile unsigned int *) 0x80004000))
#define APB0SCR 	  (*((volatile unsigned int *) 0x80004004))
#define APB1SCR	  	  (*((volatile unsigned int *) 0x80004008))
#define APB3SCR	  	  (*((volatile unsigned int *) 0x8000400C))
#define DCDCSCR	  	  (*((volatile unsigned int *) 0x80004010))
#define RTCSCR 	  	  (*((volatile unsigned int *) 0x80004014))
#define MCISCR 	  	  (*((volatile unsigned int *) 0x80004018))
#define UARTSCR	  	  (*((volatile unsigned int *) 0x8000401C))
#define DAIOSCR   	  (*((volatile unsigned int *) 0x80004020))
#define DAISCR 	  	  (*((volatile unsigned int *) 0x80004024))

#define SYSFSR1   	  (*((volatile unsigned int *) 0x8000402C))
#define APB0FSR1 	  (*((volatile unsigned int *) 0x80004030))
#define APB1FSR1  	  (*((volatile unsigned int *) 0x80004034))
#define APB3FSR1  	  (*((volatile unsigned int *) 0x80004038))
#define DCDCFSR1  	  (*((volatile unsigned int *) 0x8000403C))
#define RTCFSR1	 	  (*((volatile unsigned int *) 0x80004040))
#define MCIFSR1   	  (*((volatile unsigned int *) 0x80004044))
#define UARTFSR1  	  (*((volatile unsigned int *) 0x80004048))
#define DAIOFSR1   	  (*((volatile unsigned int *) 0x8000404C))
#define DAIFSR1	  	  (*((volatile unsigned int *) 0x80004050))

#define SYSFSR2   	  (*((volatile unsigned int *) 0x80004058))
#define APB0FSR2 	  (*((volatile unsigned int *) 0x8000405C))
#define APB1FSR2  	  (*((volatile unsigned int *) 0x80004060))
#define APB3FSR2  	  (*((volatile unsigned int *) 0x80004064))
#define DCDCFSR2  	  (*((volatile unsigned int *) 0x80004068))
#define RTCFSR2	 	  (*((volatile unsigned int *) 0x8000406C))
#define MCIFSR2   	  (*((volatile unsigned int *) 0x80004070))
#define UARTFSR2  	  (*((volatile unsigned int *) 0x80004074))
#define DAIOFSR2   	  (*((volatile unsigned int *) 0x80004078))
#define DAIFSR2	  	  (*((volatile unsigned int *) 0x8000407C))

#define SYSSSR   	  (*((volatile unsigned int *) 0x80004084))
#define APB0SSR 	  (*((volatile unsigned int *) 0x80004088))
#define APB1SSR  	  (*((volatile unsigned int *) 0x8000408C))
#define APB3SSR  	  (*((volatile unsigned int *) 0x80004090))
#define DCDCSSR  	  (*((volatile unsigned int *) 0x80004094))
#define RTCSSR	 	  (*((volatile unsigned int *) 0x80004098))
#define MCISSR   	  (*((volatile unsigned int *) 0x8000409C))
#define UARTSSR  	  (*((volatile unsigned int *) 0x800040A0))
#define DAIOSSR   	  (*((volatile unsigned int *) 0x800040A4))
#define DAISSR	  	  (*((volatile unsigned int *) 0x800040A8))

