HorseMa/uClinux-STM32/uClinux-dist/linux-2.6.x/include/asm-arm/arch-lpc28xx/lpc28xx.h
#define SYSBCR   	  (*((volatile unsigned int *) 0x800043F0))
#define APB0BCR 	  (*((volatile unsigned int *) 0x800043F4))
#define DAIOBCR	  	  (*((volatile unsigned int *) 0x800043F8))

/* Fractional Divider */
#define SYSFDCR0   	  (*((volatile unsigned int *) 0x800043FC))
#define SYSFDCR1   	  (*((volatile unsigned int *) 0x80004400))
#define SYSFDCR2   	  (*((volatile unsigned int *) 0x80004404))
#define SYSFDCR3   	  (*((volatile unsigned int *) 0x80004408))
#define SYSFDCR4   	  (*((volatile unsigned int *) 0x8000440C))
#define SYSFDCR5   	  (*((volatile unsigned int *) 0x80004410))
#define APB0FDCR0  	  (*((volatile unsigned int *) 0x80004414))
#define APB0FDCR1  	  (*((volatile unsigned int *) 0x80004418))
#define APB1FDCR  	  (*((volatile unsigned int *) 0x8000441C))
#define APB3FDCR  	  (*((volatile unsigned int *) 0x80004420))
#define UARTFDCR  	  (*((volatile unsigned int *) 0x80004424))
#define DAIOFDCR0  	  (*((volatile unsigned int *) 0x80004428))
#define DAIOFDCR1  	  (*((volatile unsigned int *) 0x8000442C))
#define DAIOFDCR2  	  (*((volatile unsigned int *) 0x80004430))
#define DAIOFDCR3  	  (*((volatile unsigned int *) 0x80004434))
#define DAIOFDCR4  	  (*((volatile unsigned int *) 0x80004438))
#define DAIOFDCR5  	  (*((volatile unsigned int *) 0x8000443C))

/* Power Control */
#define APB0PCR0   	  (*((volatile unsigned int *) 0x800040B0))
#define APB1PCR0   	  (*((volatile unsigned int *) 0x800040B4))
#define APB2PCR0   	  (*((volatile unsigned int *) 0x800040B8))
#define APB3PCR0   	  (*((volatile unsigned int *) 0x800040BC))
#define MMIOPCR0   	  (*((volatile unsigned int *) 0x800040C0))
#define AHB0PCR   	  (*((volatile unsigned int *) 0x800040C4))
#define MCIPCR0   	  (*((volatile unsigned int *) 0x800040C8))
#define MCIPCR1   	  (*((volatile unsigned int *) 0x800040CC))
#define UARTPCR0   	  (*((volatile unsigned int *) 0x800040D0))
#define DSSPCR0   	  (*((volatile unsigned int *) 0x800040D4))
#define X1		  (*((volatile unsigned int *) 0x800040D8))
#define FLSHPCR0   	  (*((volatile unsigned int *) 0x800040DC))
#define FLSHPCR1   	  (*((volatile unsigned int *) 0x800040E0))
#define FLSHPCR2   	  (*((volatile unsigned int *) 0x800040E4))
#define LCDPCR0   	  (*((volatile unsigned int *) 0x800040E8))
#define LCDPCR1   	  (*((volatile unsigned int *) 0x800040EC))
#define DMAPCR0   	  (*((volatile unsigned int *) 0x800040F0))
#define DMAPCR1   	  (*((volatile unsigned int *) 0x800040F4))
#define USBPCR0   	  (*((volatile unsigned int *) 0x800040F8))
#define CPUPCR0   	  (*((volatile unsigned int *) 0x800040FC))
#define CPUPCR1   	  (*((volatile unsigned int *) 0x80004100))
#define CPUPCR2   	  (*((volatile unsigned int *) 0x80004104))
#define RAMPCR   	  (*((volatile unsigned int *) 0x80004108))
#define ROMPCR   	  (*((volatile unsigned int *) 0x8000410C))
#define EMCPCR0   	  (*((volatile unsigned int *) 0x80004110))
#define EMCPCR1   	  (*((volatile unsigned int *) 0x80004114))
#define MMIOPCR1   	  (*((volatile unsigned int *) 0x80004118))
#define APB0PCR1   	  (*((volatile unsigned int *) 0x8000411C))
#define EVRTPCR   	  (*((volatile unsigned int *) 0x80004120))
#define RTCPCR0   	  (*((volatile unsigned int *) 0x80004124))
#define ADCPCR0   	  (*((volatile unsigned int *) 0x80004128))
#define ADCPCR1   	  (*((volatile unsigned int *) 0x8000412C))
#define WDTPCR   	  (*((volatile unsigned int *) 0x80004130))
#define IOCPCR   	  (*((volatile unsigned int *) 0x80004134))
#define CGUPCR   	  (*((volatile unsigned int *) 0x80004138))
#define SYSCPCR   	  (*((volatile unsigned int *) 0x8000413C))
#define APB1PCR1   	  (*((volatile unsigned int *) 0x80004140))
#define T0PCR   	  (*((volatile unsigned int *) 0x80004144))
#define T1PCR   	  (*((volatile unsigned int *) 0x80004148))
#define I2CPCR   	  (*((volatile unsigned int *) 0x8000414C))
#define APB3PCR1   	  (*((volatile unsigned int *) 0x80004150))
#define SCONPCR   	  (*((volatile unsigned int *) 0x80004154))
#define DAIPCR0   	  (*((volatile unsigned int *) 0x80004158))
#define X2		  (*((volatile unsigned int *) 0x8000415C))
#define DAOPCR0   	  (*((volatile unsigned int *) 0x80004160))
#define DSSPCR1   	  (*((volatile unsigned int *) 0x80004164))
#define SAI1PCR   	  (*((volatile unsigned int *) 0x80004168))
#define X3 		  (*((volatile unsigned int *) 0x8000416C))
#define X4 		  (*((volatile unsigned int *) 0x80004170))
#define SAI4PCR	   	  (*((volatile unsigned int *) 0x80004174))
#define SAO1PCR	   	  (*((volatile unsigned int *) 0x80004178))
#define SAO2PCR	   	  (*((volatile unsigned int *) 0x8000417C))
#define X5 		  (*((volatile unsigned int *) 0x80004180))
#define DDACPCR0   	  (*((volatile unsigned int *) 0x80004184))
#define EDGEPCR	   	  (*((volatile unsigned int *) 0x80004188))
#define DADCPCR0   	  (*((volatile unsigned int *) 0x8000418C))
#define DCDCPCR	   	  (*((volatile unsigned int *) 0x80004190))
#define RTCPCR1	   	  (*((volatile unsigned int *) 0x80004194))
#define MCIPCR2	   	  (*((volatile unsigned int *) 0x80004198))
#define UARTPCR1   	  (*((volatile unsigned int *) 0x8000419C))
#define DDACPCR1   	  (*((volatile unsigned int *) 0x800041A0))
#define DDACPCR2   	  (*((volatile unsigned int *) 0x800041A4))
#define DADCPCR1   	  (*((volatile unsigned int *) 0x800041A8))
#define DADCPCR2   	  (*((volatile unsigned int *) 0x800041AC))
#define DAIPCR1   	  (*((volatile unsigned int *) 0x800041B0))
#define DAIPCR2   	  (*((volatile unsigned int *) 0x800041B4))
#define DAOPCR1   	  (*((volatile unsigned int *) 0x800041B8))
#define DAOPCR2   	  (*((volatile unsigned int *) 0x800041BC))
#define DAOPCR3   	  (*((volatile unsigned int *) 0x800041C0))
#define DAIPCR3   	  (*((volatile unsigned int *) 0x800041C4))
#define X6		  (*((volatile unsigned int *) 0x800041C8))

/* Power Status */
#define APB0PSR0   	  (*((volatile unsigned int *) 0x800041CC))
#define APB1PSR0   	  (*((volatile unsigned int *) 0x800041D0))
#define APB2PSR0   	  (*((volatile unsigned int *) 0x800041D4))
#define APB3PSR0   	  (*((volatile unsigned int *) 0x800041D8))
#define MMIOPSR0   	  (*((volatile unsigned int *) 0x800041DC))
#define AHB0PSR   	  (*((volatile unsigned int *) 0x800041E0))
#define MCIPSR0   	  (*((volatile unsigned int *) 0x800041E4))
#define MCIPSR1   	  (*((volatile unsigned int *) 0x800041E8))
#define UARTPSR0   	  (*((volatile unsigned int *) 0x800041EC))
#define DSSPSR0   	  (*((volatile unsigned int *) 0x800041F0))
#define X7		  (*((volatile unsigned int *) 0x800041F4))
#define FLSHPSR0   	  (*((volatile unsigned int *) 0x800041F8))
#define FLSHPSR1   	  (*((volatile unsigned int *) 0x800041FC))
#define FLSHPSR2   	  (*((volatile unsigned int *) 0x80004200))
#define LCDPSR0   	  (*((volatile unsigned int *) 0x80004204))
#define LCDPSR1   	  (*((volatile unsigned int *) 0x80004208))
#define DMAPSR0   	  (*((volatile unsigned int *) 0x8000420C))
#define DMAPSR1   	  (*((volatile unsigned int *) 0x80004210))
#define USBPSR0   	  (*((volatile unsigned int *) 0x80004214))
#define CPUPSR0   	  (*((volatile unsigned int *) 0x80004218))
#define CPUPSR1   	  (*((volatile unsigned int *) 0x8000421C))
#define CPUPSR2   	  (*((volatile unsigned int *) 0x80004220))
#define RAMPSR   	  (*((volatile unsigned int *) 0x80004224))
#define ROMPSR   	  (*((volatile unsigned int *) 0x80004228))
#define EMCPSR0   	  (*((volatile unsigned int *) 0x8000422C))
#define EMCPSR1   	  (*((volatile unsigned int *) 0x80004230))
#define MMIOPSR1   	  (*((volatile unsigned int *) 0x80004234))
#define APB0PSR1   	  (*((volatile unsigned int *) 0x80004238))
#define EVRTPSR   	  (*((volatile unsigned int *) 0x8000423C))
#define RTCPSR0   	  (*((volatile unsigned int *) 0x80004240))
#define ADCPSR0   	  (*((volatile unsigned int *) 0x80004244))
#define ADCPSR1   	  (*((volatile unsigned int *) 0x80004248))
#define WDTPSR   	  (*((volatile unsigned int *) 0x8000424C))
#define IOCPSR   	  (*((volatile unsigned int *) 0x80004250))
#define CGUPSR   	  (*((volatile unsigned int *) 0x80004254))
#define SYSCPSR   	  (*((volatile unsigned int *) 0x80004258))
#define APB1PSR1   	  (*((volatile unsigned int *) 0x8000425C))
#define T0PSR   	  (*((volatile unsigned int *) 0x80004260))
#define T1PSR   	  (*((volatile unsigned int *) 0x80004264))
#define I2CPSR   	  (*((volatile unsigned int *) 0x80004268))
#define APB3PSR1   	  (*((volatile unsigned int *) 0x8000426C))
#define ACONPSR   	  (*((volatile unsigned int *) 0x80004270))
#define DAIPSR0   	  (*((volatile unsigned int *) 0x80004274))
#define X8		  (*((volatile unsigned int *) 0x80004278))
#define DAOPSR0   	  (*((volatile unsigned int *) 0x8000427C))
#define DSSPSR1   	  (*((volatile unsigned int *) 0x80004280))
#define SAI1PSR   	  (*((volatile unsigned int *) 0x80004284))
#define X9 		  (*((volatile unsigned int *) 0x80004288))
#define X10		  (*((volatile unsigned int *) 0x8000428C))
#define SAI4PSR	   	  (*((volatile unsigned int *) 0x80004290))
#define SAO1PSR	   	  (*((volatile unsigned int *) 0x80004294))
#define SAO2PSR	   	  (*((volatile unsigned int *) 0x80004298))
#define X11		  (*((volatile unsigned int *) 0x8000429C))
#define DDACPSR0   	  (*((volatile unsigned int *) 0x800042A0))
#define EDGEPSR	   	  (*((volatile unsigned int *) 0x800042A4))
#define DADCPSR0   	  (*((volatile unsigned int *) 0x800042A8))
#define DADCPSR	   	  (*((volatile unsigned int *) 0x800042AC))
#define RTCPSR1	   	  (*((volatile unsigned int *) 0x800042B0))
#define MCIPSR2	   	  (*((volatile unsigned int *) 0x800042B4))
#define UARTPSR1   	  (*((volatile unsigned int *) 0x800042B8))
#define DDACPSR1   	  (*((volatile unsigned int *) 0x800042BC))
#define DDACPSR2   	  (*((volatile unsigned int *) 0x800042C0))
#define DADCPSR1   	  (*((volatile unsigned int *) 0x800042C4))
#define DADCPSR2   	  (*((volatile unsigned int *) 0x800042C8))
#define DAIPSR1   	  (*((volatile unsigned int *) 0x800042CC))
#define DAIPSR2   	  (*((volatile unsigned int *) 0x800042D0))
#define DAOPSR1   	  (*((volatile unsigned int *) 0x800042D4))
#define DAOPSR2   	  (*((volatile unsigned int *) 0x800042D8))
#define DAOPSR3   	  (*((volatile unsigned int *) 0x800042DC))
#define DAIPSR3   	  (*((volatile unsigned int *) 0x800042E0))
#define X12		  (*((volatile unsigned int *) 0x800042E4))

