HorseMa/uClinux-STM32/uClinux-dist/linux-2.6.x/include/asm-arm/arch-lpc28xx/lpc28xx.h
/* Enable Select  */
#define APB0ESR0   	  (*((volatile unsigned int *) 0x800042E8))
#define APB1ESR0   	  (*((volatile unsigned int *) 0x800042EC))
#define APB2ESR0   	  (*((volatile unsigned int *) 0x800042F0))
#define APB3ESR0   	  (*((volatile unsigned int *) 0x800042F4))
#define MMIOESR0   	  (*((volatile unsigned int *) 0x800042F8))
#define AHB0ESR   	  (*((volatile unsigned int *) 0x800042FC))
#define MCIESR0   	  (*((volatile unsigned int *) 0x80004300))
#define MCIESR1   	  (*((volatile unsigned int *) 0x80004304))
#define UARTESR0   	  (*((volatile unsigned int *) 0x80004308))
#define DSSESR0   	  (*((volatile unsigned int *) 0x8000430C))
#define X13		  (*((volatile unsigned int *) 0x80004310))
#define FLSHESR0   	  (*((volatile unsigned int *) 0x80004314))
#define FLSHESR1   	  (*((volatile unsigned int *) 0x80004318))
#define FLSHESR2   	  (*((volatile unsigned int *) 0x8000431C))
#define LCDESR0   	  (*((volatile unsigned int *) 0x80004320))
#define LCDESR1   	  (*((volatile unsigned int *) 0x80004324))
#define DMAESR0   	  (*((volatile unsigned int *) 0x80004328))
#define DMAESR1   	  (*((volatile unsigned int *) 0x8000432C))
#define USBESR0   	  (*((volatile unsigned int *) 0x80004330))
#define CPUESR0   	  (*((volatile unsigned int *) 0x80004334))
#define CPUESR1   	  (*((volatile unsigned int *) 0x80004338))
#define CPUESR2   	  (*((volatile unsigned int *) 0x8000433C))
#define RAMESR   	  (*((volatile unsigned int *) 0x80004340))
#define ROMESR   	  (*((volatile unsigned int *) 0x80004344))
#define EMCESR0   	  (*((volatile unsigned int *) 0x80004348))
#define EMCESR1   	  (*((volatile unsigned int *) 0x8000434C))
#define MMIOESR1   	  (*((volatile unsigned int *) 0x80004350))
#define APB0ESR1   	  (*((volatile unsigned int *) 0x80004354))
#define EVRTESR   	  (*((volatile unsigned int *) 0x80004358))
#define RTCESR   	  (*((volatile unsigned int *) 0x8000435C))
#define ADCESR0   	  (*((volatile unsigned int *) 0x80004360))
#define ADCESR1   	  (*((volatile unsigned int *) 0x80004364))
#define WDTESR   	  (*((volatile unsigned int *) 0x80004368))
#define IOCESR   	  (*((volatile unsigned int *) 0x8000436C))
#define CGUESR   	  (*((volatile unsigned int *) 0x80004370))
#define SYSCESR   	  (*((volatile unsigned int *) 0x80004374))
#define APB1ESR1   	  (*((volatile unsigned int *) 0x80004378))
#define T0ESR   	  (*((volatile unsigned int *) 0x8000437C))
#define T1ESR   	  (*((volatile unsigned int *) 0x80004380))
#define I2CESR   	  (*((volatile unsigned int *) 0x80004384))
#define APB3ESR1   	  (*((volatile unsigned int *) 0x80004388))
#define ACONESR   	  (*((volatile unsigned int *) 0x8000438C))
#define DAIESR0   	  (*((volatile unsigned int *) 0x80004390))
#define X14		  (*((volatile unsigned int *) 0x80004394))
#define DAOESR0   	  (*((volatile unsigned int *) 0x80004398))
#define DSSESR1   	  (*((volatile unsigned int *) 0x8000439C))
#define SAI1ESR   	  (*((volatile unsigned int *) 0x800043A0))
#define X15		  (*((volatile unsigned int *) 0x800043A4))
#define X16		  (*((volatile unsigned int *) 0x800043A8))
#define SAI4ESR	   	  (*((volatile unsigned int *) 0x800043AC))
#define SAO1ESR	   	  (*((volatile unsigned int *) 0x800043B0))
#define SAO2ESR	   	  (*((volatile unsigned int *) 0x800043B4))
#define X17		  (*((volatile unsigned int *) 0x800043B8))
#define DDACESR0   	  (*((volatile unsigned int *) 0x800043BC))
#define EDGEESR	   	  (*((volatile unsigned int *) 0x800043C0))
#define DADCESR0   	  (*((volatile unsigned int *) 0x800043C4))
#define UARTESR1   	  (*((volatile unsigned int *) 0x800043C8))
#define DDACESR1   	  (*((volatile unsigned int *) 0x800043CC))
#define DDACESR2   	  (*((volatile unsigned int *) 0x800043D0))
#define DADCESR1   	  (*((volatile unsigned int *) 0x800043D4))
#define DADCESR2   	  (*((volatile unsigned int *) 0x800043D8))
#define DAIESR1   	  (*((volatile unsigned int *) 0x800043DC))
#define DAIESR2   	  (*((volatile unsigned int *) 0x800043E0))
#define DAOESR1   	  (*((volatile unsigned int *) 0x800043E4))
#define DAOESR2   	  (*((volatile unsigned int *) 0x800043E8))
#define DAOESR3   	  (*((volatile unsigned int *) 0x800043EC))

/* Software Reset  */
#define APB0RES   	  (*((volatile unsigned int *) 0x80004C18))
#define APB0RES2   	  (*((volatile unsigned int *) 0x80004C1C))
#define APB1RES   	  (*((volatile unsigned int *) 0x80004C20))
#define APB1RES2   	  (*((volatile unsigned int *) 0x80004C24))
#define APB2RES   	  (*((volatile unsigned int *) 0x80004C28))
#define APB3RES   	  (*((volatile unsigned int *) 0x80004C2C))
#define APB3RES2  	  (*((volatile unsigned int *) 0x80004C30))
#define MMIORES   	  (*((volatile unsigned int *) 0x80004C34))
#define AHB0RES  	  (*((volatile unsigned int *) 0x80004C38))
#define T0RES   	  (*((volatile unsigned int *) 0x80004C3C))
#define T1RES   	  (*((volatile unsigned int *) 0x80004C40))
#define MCIRES   	  (*((volatile unsigned int *) 0x80004C44))
#define MCIRES2  	  (*((volatile unsigned int *) 0x80004C48))
#define UARTRES   	  (*((volatile unsigned int *) 0x80004C4C))
#define I2CRES   	  (*((volatile unsigned int *) 0x80004C50))
#define ACONRES   	  (*((volatile unsigned int *) 0x80004C58))
#define DAIRES   	  (*((volatile unsigned int *) 0x80004C60))
#define DAORES   	  (*((volatile unsigned int *) 0x80004C68))
#define DADCRES   	  (*((volatile unsigned int *) 0x80004C6C))
#define EDGERES   	  (*((volatile unsigned int *) 0x80004C70))
#define DDACRES   	  (*((volatile unsigned int *) 0x80004C74))
#define SAI1RES   	  (*((volatile unsigned int *) 0x80004C78))
#define SAI4RES   	  (*((volatile unsigned int *) 0x80004C84))
#define SAO1RES   	  (*((volatile unsigned int *) 0x80004C88))
#define SAO2RES   	  (*((volatile unsigned int *) 0x80004C8C))
#define FLSHRES   	  (*((volatile unsigned int *) 0x80004C94))
#define LCDRES   	  (*((volatile unsigned int *) 0x80004C98))
#define DMARES   	  (*((volatile unsigned int *) 0x80004C9C))
#define USBRES   	  (*((volatile unsigned int *) 0x80004CA0))
#define EMCRES   	  (*((volatile unsigned int *) 0x80004CA4))
#define MMIORES2   	  (*((volatile unsigned int *) 0x80004CA8))
/* -------------------------------------- */

/* External Memory Controller (EMC) */
#define EMC_BASE_ADDR		0x80008000
#define EMC_CTRL       (*(volatile unsigned long *)(EMC_BASE_ADDR + 0x000))
#define EMC_STAT       (*(volatile unsigned long *)(EMC_BASE_ADDR + 0x004))
#define EMC_CONFIG     (*(volatile unsigned long *)(EMC_BASE_ADDR + 0x008))

