HorseMa/uClinux-STM32/uClinux-dist/linux-2.6.x/include/asm-arm/arch-lpc28xx/lpc28xx.h
/* Dynamic RAM access registers */
#define EMC_DYN_CTRL     (*(volatile unsigned long *)(EMC_BASE_ADDR + 0x020))
#define EMC_DYN_RFSH     (*(volatile unsigned long *)(EMC_BASE_ADDR + 0x024))
#define EMC_DYN_RD_CFG   (*(volatile unsigned long *)(EMC_BASE_ADDR + 0x028))
#define EMC_DYN_RP       (*(volatile unsigned long *)(EMC_BASE_ADDR + 0x030))
#define EMC_DYN_RAS      (*(volatile unsigned long *)(EMC_BASE_ADDR + 0x034))
#define EMC_DYN_SREX     (*(volatile unsigned long *)(EMC_BASE_ADDR + 0x038))
#define EMC_DYN_APR      (*(volatile unsigned long *)(EMC_BASE_ADDR + 0x03C))
#define EMC_DYN_DAL      (*(volatile unsigned long *)(EMC_BASE_ADDR + 0x040))
#define EMC_DYN_WR       (*(volatile unsigned long *)(EMC_BASE_ADDR + 0x044))
#define EMC_DYN_RC       (*(volatile unsigned long *)(EMC_BASE_ADDR + 0x048))
#define EMC_DYN_RFC      (*(volatile unsigned long *)(EMC_BASE_ADDR + 0x04C))
#define EMC_DYN_XSR      (*(volatile unsigned long *)(EMC_BASE_ADDR + 0x050))
#define EMC_DYN_RRD      (*(volatile unsigned long *)(EMC_BASE_ADDR + 0x054))
#define EMC_DYN_MRD      (*(volatile unsigned long *)(EMC_BASE_ADDR + 0x058))

#define EMC_DYN_CFG0     (*(volatile unsigned long *)(EMC_BASE_ADDR + 0x100))
#define EMC_DYN_RASCAS0  (*(volatile unsigned long *)(EMC_BASE_ADDR + 0x104))

/* static RAM access registers */
#define EMC_STA_CFG0      (*(volatile unsigned long *)(EMC_BASE_ADDR + 0x200))
#define EMC_STA_WAITWEN0  (*(volatile unsigned long *)(EMC_BASE_ADDR + 0x204))
#define EMC_STA_WAITOEN0  (*(volatile unsigned long *)(EMC_BASE_ADDR + 0x208))
#define EMC_STA_WAITRD0   (*(volatile unsigned long *)(EMC_BASE_ADDR + 0x20C))
#define EMC_STA_WAITPAGE0 (*(volatile unsigned long *)(EMC_BASE_ADDR + 0x210))
#define EMC_STA_WAITWR0   (*(volatile unsigned long *)(EMC_BASE_ADDR + 0x214))
#define EMC_STA_WAITTURN0 (*(volatile unsigned long *)(EMC_BASE_ADDR + 0x218))

#define EMC_STA_CFG1      (*(volatile unsigned long *)(EMC_BASE_ADDR + 0x220))
#define EMC_STA_WAITWEN1  (*(volatile unsigned long *)(EMC_BASE_ADDR + 0x224))
#define EMC_STA_WAITOEN1  (*(volatile unsigned long *)(EMC_BASE_ADDR + 0x228))
#define EMC_STA_WAITRD1   (*(volatile unsigned long *)(EMC_BASE_ADDR + 0x22C))
#define EMC_STA_WAITPAGE1 (*(volatile unsigned long *)(EMC_BASE_ADDR + 0x230))
#define EMC_STA_WAITWR1   (*(volatile unsigned long *)(EMC_BASE_ADDR + 0x234))
#define EMC_STA_WAITTURN1 (*(volatile unsigned long *)(EMC_BASE_ADDR + 0x238))

#define EMC_STA_CFG2      (*(volatile unsigned long *)(EMC_BASE_ADDR + 0x240))
#define EMC_STA_WAITWEN2  (*(volatile unsigned long *)(EMC_BASE_ADDR + 0x244))
#define EMC_STA_WAITOEN2  (*(volatile unsigned long *)(EMC_BASE_ADDR + 0x248))
#define EMC_STA_WAITRD2   (*(volatile unsigned long *)(EMC_BASE_ADDR + 0x24C))
#define EMC_STA_WAITPAGE2 (*(volatile unsigned long *)(EMC_BASE_ADDR + 0x250))
#define EMC_STA_WAITWR2   (*(volatile unsigned long *)(EMC_BASE_ADDR + 0x254))
#define EMC_STA_WAITTURN2 (*(volatile unsigned long *)(EMC_BASE_ADDR + 0x258))

/* Interrupt Controller */
#define INT_PRIOMASK0 	(*((volatile unsigned int *) 0x80300000))
#define INT_PRIOMASK1   (*((volatile unsigned int *) 0x80300004))
#define INT_VECTOR0     (*((volatile unsigned int *) 0x80300100))
#define INT_VECTOR1     (*((volatile unsigned int *) 0x80300104))
#define INT_PENDING     (*((volatile unsigned int *) 0x80300200))
#define INT_FEATURES    (*((volatile unsigned int *) 0x80300300))

#define INT_REQBASE	0x80300400
#define INT_REQ1 	(*((volatile unsigned int *) 0x80300404))
#define INT_REQ2        (*((volatile unsigned int *) 0x80300408))
#define INT_REQ3        (*((volatile unsigned int *) 0x8030040C))
#define INT_REQ4        (*((volatile unsigned int *) 0x80300410))
#define INT_REQ5        (*((volatile unsigned int *) 0x80300414))
#define INT_REQ6        (*((volatile unsigned int *) 0x80300418))
#define INT_REQ7        (*((volatile unsigned int *) 0x8030041C))
#define INT_REQ8        (*((volatile unsigned int *) 0x80300420))
#define INT_REQ9        (*((volatile unsigned int *) 0x80300424))
#define INT_REQ10       (*((volatile unsigned int *) 0x80300428))
#define INT_REQ11       (*((volatile unsigned int *) 0x8030042C))
#define INT_REQ12       (*((volatile unsigned int *) 0x80300430))
#define INT_REQ13       (*((volatile unsigned int *) 0x80300434))
#define INT_REQ14       (*((volatile unsigned int *) 0x80300438))
#define INT_REQ15       (*((volatile unsigned int *) 0x8030043C))
#define INT_REQ16       (*((volatile unsigned int *) 0x80300440))
#define INT_REQ17       (*((volatile unsigned int *) 0x80300444))
#define INT_REQ18       (*((volatile unsigned int *) 0x80300448))
#define INT_REQ19       (*((volatile unsigned int *) 0x8030044C))
#define INT_REQ20       (*((volatile unsigned int *) 0x80300450))
#define INT_REQ21       (*((volatile unsigned int *) 0x80300454))
#define INT_REQ22       (*((volatile unsigned int *) 0x80300458))
#define INT_REQ23       (*((volatile unsigned int *) 0x8030045C))
#define INT_REQ24       (*((volatile unsigned int *) 0x80300460))
#define INT_REQ25       (*((volatile unsigned int *) 0x80300464))
#define INT_REQ26       (*((volatile unsigned int *) 0x80300468))
#define INT_REQ27       (*((volatile unsigned int *) 0x8030046C))
#define INT_REQ28       (*((volatile unsigned int *) 0x80300470))
#define INT_REQ29       (*((volatile unsigned int *) 0x80300474))

/* ------- Event Router ------- */

/* Input Group 0 Registers */
#define EVAPR0     (*((volatile unsigned int *) 0x80000CC0))
#define EVATR0     (*((volatile unsigned int *) 0x80000CE0))
#define EVECLR0    (*((volatile unsigned int *) 0x80000C20))
#define EVESET0    (*((volatile unsigned int *) 0x80000C40))
#define EVRSR0     (*((volatile unsigned int *) 0x80000D20))
#define EVMASK0    (*((volatile unsigned int *) 0x80000C60))
#define EVMCLR0    (*((volatile unsigned int *) 0x80000C80))
#define EVMSET0    (*((volatile unsigned int *) 0x80000CA0))
#define EVPEND0    (*((volatile unsigned int *) 0x80000C00))

