HorseMa/uClinux-STM32/uClinux-dist/linux-2.6.x/include/asm-arm/arch-lpc28xx/lpc28xx.h
#define EVIOMK00   (*((volatile unsigned int *) 0x80001400))
#define EVIOMK10   (*((volatile unsigned int *) 0x80001420))
#define EVIOMK20   (*((volatile unsigned int *) 0x80001440))
#define EVIOMK30   (*((volatile unsigned int *) 0x80001460))
#define EVIOMK40   (*((volatile unsigned int *) 0x80001480))

#define EVIOMC00   (*((volatile unsigned int *) 0x80001800))
#define EVIOMC10   (*((volatile unsigned int *) 0x80001820))
#define EVIOMC20   (*((volatile unsigned int *) 0x80001840))
#define EVIOMC30   (*((volatile unsigned int *) 0x80001860))
#define EVIOMC40   (*((volatile unsigned int *) 0x80001880))

#define EVIOMS00   (*((volatile unsigned int *) 0x80001C00))
#define EVIOMS10   (*((volatile unsigned int *) 0x80001C20))
#define EVIOMS20   (*((volatile unsigned int *) 0x80001C40))
#define EVIOMS30   (*((volatile unsigned int *) 0x80001C60))
#define EVIOMS40   (*((volatile unsigned int *) 0x80001C80))

#define EVIOP00    (*((volatile unsigned int *) 0x80001000))
#define EVIOP10    (*((volatile unsigned int *) 0x80001020))
#define EVIOP20    (*((volatile unsigned int *) 0x80001040))
#define EVIOP30    (*((volatile unsigned int *) 0x80001060))
#define EVIOP40    (*((volatile unsigned int *) 0x80001080))

/* Input Group 1 Registers */
#define EVAPR1     (*((volatile unsigned int *) 0x80000CC4))
#define EVATR1     (*((volatile unsigned int *) 0x80000CE4))
#define EVECLR1    (*((volatile unsigned int *) 0x80000C24))
#define EVESET1    (*((volatile unsigned int *) 0x80000C44))
#define EVRSR1     (*((volatile unsigned int *) 0x80000D24))
#define EVMASK1    (*((volatile unsigned int *) 0x80000C64))
#define EVMCLR1    (*((volatile unsigned int *) 0x80000C84))
#define EVMSET1    (*((volatile unsigned int *) 0x80000CA4))
#define EVPEND1    (*((volatile unsigned int *) 0x80000C04))

#define EVIOMK01   (*((volatile unsigned int *) 0x80001404))
#define EVIOMK11   (*((volatile unsigned int *) 0x80001424))
#define EVIOMK21   (*((volatile unsigned int *) 0x80001444))
#define EVIOMK31   (*((volatile unsigned int *) 0x80001464))
#define EVIOMK41   (*((volatile unsigned int *) 0x80001484))

#define EVIOMC01   (*((volatile unsigned int *) 0x80001804))
#define EVIOMC11   (*((volatile unsigned int *) 0x80001824))
#define EVIOMC21   (*((volatile unsigned int *) 0x80001844))
#define EVIOMC31   (*((volatile unsigned int *) 0x80001864))
#define EVIOMC41   (*((volatile unsigned int *) 0x80001884))

#define EVIOMS01   (*((volatile unsigned int *) 0x80001C04))
#define EVIOMS11   (*((volatile unsigned int *) 0x80001C24))
#define EVIOMS21   (*((volatile unsigned int *) 0x80001C44))
#define EVIOMS31   (*((volatile unsigned int *) 0x80001C64))
#define EVIOMS41   (*((volatile unsigned int *) 0x80001C84))

#define EVIOP01    (*((volatile unsigned int *) 0x80001004))
#define EVIOP11    (*((volatile unsigned int *) 0x80001024))
#define EVIOP21    (*((volatile unsigned int *) 0x80001044))
#define EVIOP31    (*((volatile unsigned int *) 0x80001064))
#define EVIOP41    (*((volatile unsigned int *) 0x80001084))

/* Input Group 2 Registers */
#define EVAPR2     (*((volatile unsigned int *) 0x80000CC8))
#define EVATR2     (*((volatile unsigned int *) 0x80000CE8))
#define EVECLR2    (*((volatile unsigned int *) 0x80000C28))
#define EVESET2    (*((volatile unsigned int *) 0x80000C48))
#define EVRSR2     (*((volatile unsigned int *) 0x80000D28))
#define EVMASK2    (*((volatile unsigned int *) 0x80000C68))
#define EVMCLR2    (*((volatile unsigned int *) 0x80000C88))
#define EVMSET2    (*((volatile unsigned int *) 0x80000CA8))
#define EVPEND2    (*((volatile unsigned int *) 0x80000C08))

#define EVIOMK02   (*((volatile unsigned int *) 0x80001408))
#define EVIOMK12   (*((volatile unsigned int *) 0x80001428))
#define EVIOMK22   (*((volatile unsigned int *) 0x80001448))
#define EVIOMK32   (*((volatile unsigned int *) 0x80001468))
#define EVIOMK42   (*((volatile unsigned int *) 0x80001488))

#define EVIOMC02   (*((volatile unsigned int *) 0x80001808))
#define EVIOMC12   (*((volatile unsigned int *) 0x80001828))
#define EVIOMC22   (*((volatile unsigned int *) 0x80001848))
#define EVIOMC32   (*((volatile unsigned int *) 0x80001868))
#define EVIOMC42   (*((volatile unsigned int *) 0x80001888))

#define EVIOMS02   (*((volatile unsigned int *) 0x80001C08))
#define EVIOMS12   (*((volatile unsigned int *) 0x80001C28))
#define EVIOMS22   (*((volatile unsigned int *) 0x80001C48))
#define EVIOMS32   (*((volatile unsigned int *) 0x80001C68))
#define EVIOMS42   (*((volatile unsigned int *) 0x80001C88))

#define EVIOP02    (*((volatile unsigned int *) 0x80001008))
#define EVIOP12    (*((volatile unsigned int *) 0x80001028))
#define EVIOP22    (*((volatile unsigned int *) 0x80001048))
#define EVIOP32    (*((volatile unsigned int *) 0x80001068))
#define EVIOP42    (*((volatile unsigned int *) 0x80001088))

/* Input Group 3 Registers */
#define EVAPR3     (*((volatile unsigned int *) 0x80000CCC))
#define EVATR3     (*((volatile unsigned int *) 0x80000CEC))
#define EVECLR3    (*((volatile unsigned int *) 0x80000C2C))
#define EVESET3    (*((volatile unsigned int *) 0x80000C4C))
#define EVRSR3     (*((volatile unsigned int *) 0x80000D2C))
#define EVMASK3    (*((volatile unsigned int *) 0x80000C6C))
#define EVMCLR3    (*((volatile unsigned int *) 0x80000C8C))
#define EVMSET3    (*((volatile unsigned int *) 0x80000CAC))
#define EVPEND3    (*((volatile unsigned int *) 0x80000C0C))

#define EVIOMK03   (*((volatile unsigned int *) 0x8000140C))
#define EVIOMK13   (*((volatile unsigned int *) 0x8000142C))
#define EVIOMK23   (*((volatile unsigned int *) 0x8000144C))
#define EVIOMK33   (*((volatile unsigned int *) 0x8000146C))
#define EVIOMK43   (*((volatile unsigned int *) 0x8000148C))

#define EVIOMC03   (*((volatile unsigned int *) 0x8000180C))
#define EVIOMC13   (*((volatile unsigned int *) 0x8000182C))
#define EVIOMC23   (*((volatile unsigned int *) 0x8000184C))
#define EVIOMC33   (*((volatile unsigned int *) 0x8000186C))
#define EVIOMC43   (*((volatile unsigned int *) 0x8000188C))

