HorseMa/uClinux-STM32/uClinux-dist/linux-2.6.x/include/asm-arm/arch-lpc28xx/lpc28xx.h
#define EVIOMS03   (*((volatile unsigned int *) 0x80001C0C))
#define EVIOMS13   (*((volatile unsigned int *) 0x80001C2C))
#define EVIOMS23   (*((volatile unsigned int *) 0x80001C4C))
#define EVIOMS33   (*((volatile unsigned int *) 0x80001C6C))
#define EVIOMS43   (*((volatile unsigned int *) 0x80001C8C))

#define EVIOP03    (*((volatile unsigned int *) 0x8000100C))
#define EVIOP13    (*((volatile unsigned int *) 0x8000102C))
#define EVIOP23    (*((volatile unsigned int *) 0x8000104C))
#define EVIOP33    (*((volatile unsigned int *) 0x8000106C))
#define EVIOP43    (*((volatile unsigned int *) 0x8000108C))
/* -------------------------- */

/* Timer0 */
#define T0LOAD 	  (*((volatile unsigned int *) 0x80020000))
#define T0VALUE   (*((volatile unsigned int *) 0x80020004))
#define T0CTRL    (*((volatile unsigned int *) 0x80020008))
#define T0CLR     (*((volatile unsigned int *) 0x8002000C))

/* Timer1 */
#define T1LOAD 	  (*((volatile unsigned int *) 0x80020400))
#define T1VALUE   (*((volatile unsigned int *) 0x80020404))
#define T1CTRL    (*((volatile unsigned int *) 0x80020408))
#define T1CLR     (*((volatile unsigned int *) 0x8002040C))

/* Watchdog Timer */
#define WDT_SR    (*((volatile unsigned int *) 0x80002800))
#define WDT_TCR   (*((volatile unsigned int *) 0x80002804))
#define WDT_TC    (*((volatile unsigned int *) 0x80002808))
#define WDT_PR    (*((volatile unsigned int *) 0x8000280C))
#define WDT_MCR   (*((volatile unsigned int *) 0x80002814))
#define WDT_MR0   (*((volatile unsigned int *) 0x80002818))
#define WDT_MR1   (*((volatile unsigned int *) 0x8000281C))
#define WDT_EMR   (*((volatile unsigned int *) 0x8000283C))

/* Real Time Clock */
#define RTC_BASE_ADDR		0x80002000
#define RTC_CFG         (*((volatile unsigned int *) 0x80005024))
#define RTC_ILR         (*(volatile unsigned long *)(RTC_BASE_ADDR + 0x00))
#define RTC_CTC         (*(volatile unsigned long *)(RTC_BASE_ADDR + 0x04))
#define RTC_CCR         (*(volatile unsigned long *)(RTC_BASE_ADDR + 0x08))
#define RTC_CIIR        (*(volatile unsigned long *)(RTC_BASE_ADDR + 0x0C))
#define RTC_AMR         (*(volatile unsigned long *)(RTC_BASE_ADDR + 0x10))
#define RTC_CTIME0      (*(volatile unsigned long *)(RTC_BASE_ADDR + 0x14))
#define RTC_CTIME1      (*(volatile unsigned long *)(RTC_BASE_ADDR + 0x18))
#define RTC_CTIME2      (*(volatile unsigned long *)(RTC_BASE_ADDR + 0x1C))
#define RTC_SEC         (*(volatile unsigned long *)(RTC_BASE_ADDR + 0x20))
#define RTC_MIN         (*(volatile unsigned long *)(RTC_BASE_ADDR + 0x24))
#define RTC_HOUR        (*(volatile unsigned long *)(RTC_BASE_ADDR + 0x28))
#define RTC_DOM         (*(volatile unsigned long *)(RTC_BASE_ADDR + 0x2C))
#define RTC_DOW         (*(volatile unsigned long *)(RTC_BASE_ADDR + 0x30))
#define RTC_DOY         (*(volatile unsigned long *)(RTC_BASE_ADDR + 0x34))
#define RTC_MONTH       (*(volatile unsigned long *)(RTC_BASE_ADDR + 0x38))
#define RTC_YEAR        (*(volatile unsigned long *)(RTC_BASE_ADDR + 0x3C))
#define RTC_CISS        (*(volatile unsigned long *)(RTC_BASE_ADDR + 0x40))
#define RTC_ALSEC       (*(volatile unsigned long *)(RTC_BASE_ADDR + 0x60))
#define RTC_ALMIN       (*(volatile unsigned long *)(RTC_BASE_ADDR + 0x64))
#define RTC_ALHOUR      (*(volatile unsigned long *)(RTC_BASE_ADDR + 0x68))
#define RTC_ALDOM       (*(volatile unsigned long *)(RTC_BASE_ADDR + 0x6C))
#define RTC_ALDOW       (*(volatile unsigned long *)(RTC_BASE_ADDR + 0x70))
#define RTC_ALDOY       (*(volatile unsigned long *)(RTC_BASE_ADDR + 0x74))
#define RTC_ALMON       (*(volatile unsigned long *)(RTC_BASE_ADDR + 0x78))
#define RTC_ALYEAR      (*(volatile unsigned long *)(RTC_BASE_ADDR + 0x7C))

/* UART */
#define UART_RBR   (*((volatile unsigned int *) 0x80101000))
#define UART_THR   (*((volatile unsigned int *) 0x80101000))
#define UART_DLL   (*((volatile unsigned int *) 0x80101000))
#define UART_IER   (*((volatile unsigned int *) 0x80101004))
#define UART_DLM   (*((volatile unsigned int *) 0x80101004))
#define UART_IIR   (*((volatile unsigned int *) 0x80101008))
#define UART_FCR   (*((volatile unsigned int *) 0x80101008))
#define UART_LCR   (*((volatile unsigned int *) 0x8010100c))
#define UART_MCR   (*((volatile unsigned int *) 0x80011010))
#define UART_LSR   (*((volatile unsigned int *) 0x80101014))
#define UART_MSR   (*((volatile unsigned int *) 0x80101018))
#define UART_SCR   (*((volatile unsigned int *) 0x8010101c))
#define UART_ACR   (*((volatile unsigned int *) 0x80101020))
#define UART_ICR   (*((volatile unsigned int *) 0x80101024))
#define UART_FDR   (*((volatile unsigned int *) 0x80101028))
#define UART_POP   (*((volatile unsigned int *) 0x80101030))
#define UART_MODE  (*((volatile unsigned int *) 0x80101034))
#define UART_CFG   (*((volatile unsigned int *) 0x80101FD4))
#define UART_INTCE (*((volatile unsigned int *) 0x80101FD8))
#define UART_INTSE (*((volatile unsigned int *) 0x80101FDC))
#define UART_INTS  (*((volatile unsigned int *) 0x80101FE0))
#define UART_INTE  (*((volatile unsigned int *) 0x80101FE4))
#define UART_INTCS (*((volatile unsigned int *) 0x80101FE8))
#define UART_INTSS (*((volatile unsigned int *) 0x80101FEC))

/* GPDMA  */
#define DMAREGBASE	0x80103800
#define DMA0Source  	(*((volatile unsigned int *) 0x80103800))
#define DMA0Dest	  	(*((volatile unsigned int *) 0x80103804))
#define DMA0Length  	(*((volatile unsigned int *) 0x80103808))
#define DMA0Config	 	(*((volatile unsigned int *) 0x8010380C))
#define DMA0Enab	  	(*((volatile unsigned int *) 0x80103810))
#define DMA0Count	  	(*((volatile unsigned int *) 0x8010381C))

#define DMA1Source  	(*((volatile unsigned int *) 0x80103820))
#define DMA1Dest	  	(*((volatile unsigned int *) 0x80103824))
#define DMA1Length  	(*((volatile unsigned int *) 0x80103828))
#define DMA1Config	 	(*((volatile unsigned int *) 0x8010382C))
#define DMA1Enab	  	(*((volatile unsigned int *) 0x80103830))
#define DMA1Count	  	(*((volatile unsigned int *) 0x8010383C))

#define DMA2Source  	(*((volatile unsigned int *) 0x80103840))
#define DMA2Dest	  	(*((volatile unsigned int *) 0x80103844))
#define DMA2Length  	(*((volatile unsigned int *) 0x80103848))
#define DMA2Config	 	(*((volatile unsigned int *) 0x8010384C))
#define DMA2Enab	  	(*((volatile unsigned int *) 0x80103850))
#define DMA2Count	  	(*((volatile unsigned int *) 0x8010385C))

#define DMA3Source  	(*((volatile unsigned int *) 0x80103860))
#define DMA3Dest	  	(*((volatile unsigned int *) 0x80103864))
#define DMA3Length  	(*((volatile unsigned int *) 0x80103868))
#define DMA3Config	 	(*((volatile unsigned int *) 0x8010386C))
#define DMA3Enab	  	(*((volatile unsigned int *) 0x80103870))
#define DMA3Count	  	(*((volatile unsigned int *) 0x8010387C))

#define DMA4Source  	(*((volatile unsigned int *) 0x80103880))
#define DMA4Dest	  	(*((volatile unsigned int *) 0x80103884))
#define DMA4Length  	(*((volatile unsigned int *) 0x80103888))
#define DMA4Config	 	(*((volatile unsigned int *) 0x8010388C))
#define DMA4Enab	  	(*((volatile unsigned int *) 0x80103890))
#define DMA4Count	  	(*((volatile unsigned int *) 0x8010389C))

#define DMA5Source  	(*((volatile unsigned int *) 0x801038A0))
#define DMA5Dest	  	(*((volatile unsigned int *) 0x801038A4))
#define DMA5Length  	(*((volatile unsigned int *) 0x801038A8))
#define DMA5Config	 	(*((volatile unsigned int *) 0x801038AC))
#define DMA5Enab	  	(*((volatile unsigned int *) 0x801038B0))
#define DMA5Count	  	(*((volatile unsigned int *) 0x801038BC))

