HorseMa/uClinux-STM32/uClinux-dist/linux-2.6.x/include/asm-arm/arch-lpc28xx/lpc28xx.h
#define DMA6Source  	(*((volatile unsigned int *) 0x801038C0))
#define DMA6Dest	  	(*((volatile unsigned int *) 0x801038C4))
#define DMA6Length  	(*((volatile unsigned int *) 0x801038C8))
#define DMA6Config	 	(*((volatile unsigned int *) 0x801038CC))
#define DMA6Enab	  	(*((volatile unsigned int *) 0x801038D0))
#define DMA6Count	  	(*((volatile unsigned int *) 0x801038DC))

#define DMA7Source  	(*((volatile unsigned int *) 0x801038E0))
#define DMA7Dest	  	(*((volatile unsigned int *) 0x801038E4))
#define DMA7Length  	(*((volatile unsigned int *) 0x801038E8))
#define DMA7Config	 	(*((volatile unsigned int *) 0x801038EC))
#define DMA7Enab	  	(*((volatile unsigned int *) 0x801038F0))
#define DMA7Count	  	(*((volatile unsigned int *) 0x801038FC))

#define DMA0AltSource  		(*((volatile unsigned int *) 0x80103A00))
#define DMA0AltDest	  		(*((volatile unsigned int *) 0x80103A04))
#define DMA0AltLength  		(*((volatile unsigned int *) 0x80103A08))
#define DMA0AltConfig	 	(*((volatile unsigned int *) 0x80103A0C))

#define DMA1AltSource  		(*((volatile unsigned int *) 0x80103A10))
#define DMA1AltDest	  		(*((volatile unsigned int *) 0x80103A14))
#define DMA1AltLength  		(*((volatile unsigned int *) 0x80103A18))
#define DMA1AltConfig	 	(*((volatile unsigned int *) 0x80103A1C))

#define DMA2AltSource  		(*((volatile unsigned int *) 0x80103A20))
#define DMA2AltDest	  		(*((volatile unsigned int *) 0x80103A24))
#define DMA2AltLength  		(*((volatile unsigned int *) 0x80103A28))
#define DMA2AltConfig	 	(*((volatile unsigned int *) 0x80103A2C))

#define DMA3AltSource  		(*((volatile unsigned int *) 0x80103A30))
#define DMA3AltDest	  		(*((volatile unsigned int *) 0x80103A34))
#define DMA3AltLength  		(*((volatile unsigned int *) 0x80103A38))
#define DMA3AltConfig	 	(*((volatile unsigned int *) 0x80103A3C))

#define DMA4AltSource  		(*((volatile unsigned int *) 0x80103A40))
#define DMA4AltDest	  		(*((volatile unsigned int *) 0x80103A44))
#define DMA4AltLength  		(*((volatile unsigned int *) 0x80103A48))
#define DMA4AltConfig	 	(*((volatile unsigned int *) 0x80103A4C))

#define DMA5AltSource  		(*((volatile unsigned int *) 0x80103A50))
#define DMA5AltDest	  		(*((volatile unsigned int *) 0x80103A54))
#define DMA5AltLength  		(*((volatile unsigned int *) 0x80103A58))
#define DMA5AltConfig	 	(*((volatile unsigned int *) 0x80103A5C))

#define DMA6AltSource  		(*((volatile unsigned int *) 0x80103A60))
#define DMA6AltDest	  		(*((volatile unsigned int *) 0x80103A64))
#define DMA6AltLength  		(*((volatile unsigned int *) 0x80103A68))
#define DMA6AltConfig	 	(*((volatile unsigned int *) 0x80103A6C))

#define DMA7AltSource  		(*((volatile unsigned int *) 0x80103A70))
#define DMA7AltDest	  		(*((volatile unsigned int *) 0x80103A74))
#define DMA7AltLength  		(*((volatile unsigned int *) 0x80103A78))
#define DMA7AltConfig	 	(*((volatile unsigned int *) 0x80103A7C))

#define DMA_Enable	 	(*((volatile unsigned int *) 0x80103C00))
#define DMA_Stat	 	(*((volatile unsigned int *) 0x80103C04))
#define DMA_IRQMask	 	(*((volatile unsigned int *) 0x80103C08))
#define DMA_SoftInt 	(*((volatile unsigned int *) 0x80103C10))

#define DMA3EXTEN	(*((volatile unsigned int *) 0x80005040))
#define DMA5EXTEN	(*((volatile unsigned int *) 0x80005044))

/* I2C */
#define I2RX		(*((volatile unsigned int *) 0x80020800))
#define I2TX		(*((volatile unsigned int *) 0x80020800))
#define I2STS		(*((volatile unsigned int *) 0x80020804))
#define I2CTL		(*((volatile unsigned int *) 0x80020808))
#define I2CLKHI		(*((volatile unsigned int *) 0x8002080C))
#define I2CLKLO		(*((volatile unsigned int *) 0x80020810))
#define I2ADR		(*((volatile unsigned int *) 0x80020814))
#define I2RFL		(*((volatile unsigned int *) 0x80020818))
#define I2TFL		(*((volatile unsigned int *) 0x8002081C))
#define I2RXB		(*((volatile unsigned int *) 0x80020820))
#define I2TXB		(*((volatile unsigned int *) 0x80020824))
#define I2TXS		(*((volatile unsigned int *) 0x80020828))
#define I2STFL		(*((volatile unsigned int *) 0x8002082C))

/* ADC */
#define ADCR0		(*((volatile unsigned int *) 0x80002400))
#define ADCR1		(*((volatile unsigned int *) 0x80002404))
#define ADCR2		(*((volatile unsigned int *) 0x80002408))
#define ADCR3		(*((volatile unsigned int *) 0x8000240C))
#define ADCR4		(*((volatile unsigned int *) 0x80002410))
#define ADCR5		(*((volatile unsigned int *) 0x80002414))

#define ADCCON		(*((volatile unsigned int *) 0x80002420))
#define ADCSEL		(*((volatile unsigned int *) 0x80002424))
#define ADCINTE		(*((volatile unsigned int *) 0x80002428))
#define ADCINTS		(*((volatile unsigned int *) 0x8000242C))
#define ADCINTC		(*((volatile unsigned int *) 0x80002430))
#define ADCPD		(*((volatile unsigned int *) 0x80005028))

/* USB */
#define USB_BASE_ADDR		0x80041000
#define USBDevAdr		(*((volatile unsigned int *) 0x80041000))
#define USBEMaxSize		(*((volatile unsigned int *) 0x80041004))
#define USBEType		(*((volatile unsigned int *) 0x80041008))
#define USBMode			(*((volatile unsigned int *) 0x8004100C))
#define USBIntCfg		(*((volatile unsigned int *) 0x80041010))
#define USBDCnt			(*((volatile unsigned int *) 0x8004101c))
#define USBData			(*((volatile unsigned int *) 0x80041020))
#define USBShort		(*((volatile unsigned int *) 0x80041024))
#define USBECtrl		(*((volatile unsigned int *) 0x80041028))
#define USBEIX			(*((volatile unsigned int *) 0x8004102C))
#define USBFN			(*((volatile unsigned int *) 0x80041074))
#define USBScratch		(*((volatile unsigned int *) 0x80041078))
#define USBLock			(*((volatile unsigned int *) 0x8004107C))
#define USBTest			(*((volatile unsigned int *) 0x80041084))
#define USBIntE			(*((volatile unsigned int *) 0x8004108C))
#define USBEIntE		(*((volatile unsigned int *) 0x80041090))
#define USBIntStat		(*((volatile unsigned int *) 0x80041094))
#define USBEIntStat		(*((volatile unsigned int *) 0x80041098))
#define USBEIntClr		(*((volatile unsigned int *) 0x800410A0))
#define USBEIntSet		(*((volatile unsigned int *) 0x800410A4))
#define USBEIntP		(*((volatile unsigned int *) 0x800410A8))
#define USBIntClr		(*((volatile unsigned int *) 0x800410AC))
#define USBIntSet		(*((volatile unsigned int *) 0x800410B0))
#define USBIntP			(*((volatile unsigned int *) 0x800410B4))
#define USBClkEn		(*((volatile unsigned int *) 0x80005050))

#define UDMA0Stat		(*((volatile unsigned int *) 0x80040000))
#define UDMA0Ctrl		(*((volatile unsigned int *) 0x80040004))
#define UDMA0Src		(*((volatile unsigned int *) 0x80040008))
#define UDMA0Dest		(*((volatile unsigned int *) 0x8004000C))
#define UDMA0Throtl		(*((volatile unsigned int *) 0x80040010))
#define UDMA0Cnt		(*((volatile unsigned int *) 0x80040014))

#define UDMA1Stat		(*((volatile unsigned int *) 0x80040040))
#define UDMA1Ctrl		(*((volatile unsigned int *) 0x80040044))
#define UDMA1Src		(*((volatile unsigned int *) 0x80040048))
#define UDMA1Dest		(*((volatile unsigned int *) 0x8004004C))
#define UDMA1Throtl		(*((volatile unsigned int *) 0x80040050))
#define UDMA1Cnt		(*((volatile unsigned int *) 0x80040054))

#define UDMACtrl		(*((volatile unsigned int *) 0x80040400))
#define UDMASoftRes		(*((volatile unsigned int *) 0x80040404))
#define UDMAStat		(*((volatile unsigned int *) 0x80040408))
#define UDMAIntStat		(*((volatile unsigned int *) 0x80040410))
#define UDMAIntEn		(*((volatile unsigned int *) 0x80040418))
#define UDMAIntDis		(*((volatile unsigned int *) 0x80040420))
#define UDMAIntSet		(*((volatile unsigned int *) 0x80040428))
#define UDMAIntClr		(*((volatile unsigned int *) 0x80040430))
#define UDMAFCP0		(*((volatile unsigned int *) 0x80040500))
#define UDMAFCP1		(*((volatile unsigned int *) 0x80040504))
#define UDMAFCP2		(*((volatile unsigned int *) 0x80040508))
#define UDMAFCP3		(*((volatile unsigned int *) 0x8004050C))

/* I2S DAI/DAO */
#define SIOCR		(*((volatile unsigned int *) 0x80200384))
#define I2S_FMT		(*((volatile unsigned int *) 0x80200380))

/* I2S DAI-SAI1 */
#define L16IN1			(*((volatile unsigned int *) 0x80200000))
#define R16IN1			(*((volatile unsigned int *) 0x80200004))
#define L24IN1			(*((volatile unsigned int *) 0x80200008))
#define R24IN1			(*((volatile unsigned int *) 0x8020000C))
#define SAISTAT1		(*((volatile unsigned int *) 0x80200010))
#define SAIMASK1		(*((volatile unsigned int *) 0x80200014))
#define L32IN1			(*((volatile unsigned int *) 0x80200020))
#define R32IN1			(*((volatile unsigned int *) 0x80200040))
#define LR32IN1			(*((volatile unsigned int *) 0x80200060))

/* I2S DA0-SAO1 */
#define L16OUT1			(*((volatile unsigned int *) 0x80200200))
#define R16OUT1			(*((volatile unsigned int *) 0x80200204))
#define L24OUT1			(*((volatile unsigned int *) 0x80200208))
#define R24OUT1			(*((volatile unsigned int *) 0x8020020C))
#define SAOSTAT1		(*((volatile unsigned int *) 0x80200210))
#define SAOMASK1		(*((volatile unsigned int *) 0x80200214))
#define L32OUT1			(*((volatile unsigned int *) 0x80200220))
#define R32OUT1			(*((volatile unsigned int *) 0x80200240))
#define LR32OUT1		(*((volatile unsigned int *) 0x80200260))

/* Dual ADC */
#define DAINCTRL		(*((volatile unsigned int *) 0x802003A4))
#define DADCCTRL		(*((volatile unsigned int *) 0x802003A8))
#define DECCTRL			(*((volatile unsigned int *) 0x802003AC))
#define DECSTAT			(*((volatile unsigned int *) 0x802003B0))

