HorseMa/uClinux-STM32/uClinux-dist/linux-2.6.x/include/asm-arm/arch-lpc28xx/lpc28xx.h
/* Dual ADC-SAI4 */
#define L16IN4			(*((volatile unsigned int *) 0x80200180))
#define R16IN4			(*((volatile unsigned int *) 0x80200184))
#define L24IN4			(*((volatile unsigned int *) 0x80200188))
#define R24IN4			(*((volatile unsigned int *) 0x8020018C))
#define SAISTAT4		(*((volatile unsigned int *) 0x80200190))
#define SAIMASK4		(*((volatile unsigned int *) 0x80200194))
#define L32IN4			(*((volatile unsigned int *) 0x802001A0))
#define R32IN4			(*((volatile unsigned int *) 0x802001C0))
#define LR32IN4			(*((volatile unsigned int *) 0x802001E0))

/* Dual DAC*/
#define DDACCTRL		(*((volatile unsigned int *) 0x80200398))
#define DDACSTAT		(*((volatile unsigned int *) 0x8020039C))
#define DDACSET			(*((volatile unsigned int *) 0x802003A0))

/* Dual DAC-SAO2 */
#define L16OUT2			(*((volatile unsigned int *) 0x80200280))
#define R16OUT2			(*((volatile unsigned int *) 0x80200284))
#define L24OUT2			(*((volatile unsigned int *) 0x80200288))
#define R24OUT2			(*((volatile unsigned int *) 0x8020028C))
#define SAOSTAT2		(*((volatile unsigned int *) 0x80200290))
#define SAOMASK2		(*((volatile unsigned int *) 0x80200294))
#define L32OUT2			(*((volatile unsigned int *) 0x802002A0))
#define R32OUT2			(*((volatile unsigned int *) 0x802002C0))
#define LR32OUT2		(*((volatile unsigned int *) 0x802002E0))

/* SD/MCI */
/* MultiMedia Card Interface(MCI) Controller */
#define MCI_BASE_ADDR		0x80100000
#define MCI_POWER      (*(volatile unsigned long *)(MCI_BASE_ADDR + 0x00))
#define MCI_CLOCK      (*(volatile unsigned long *)(MCI_BASE_ADDR + 0x04))
#define MCI_ARGUMENT   (*(volatile unsigned long *)(MCI_BASE_ADDR + 0x08))
#define MCI_COMMAND    (*(volatile unsigned long *)(MCI_BASE_ADDR + 0x0C))
#define MCI_RESP_CMD   (*(volatile unsigned long *)(MCI_BASE_ADDR + 0x10))
#define MCI_RESP0      (*(volatile unsigned long *)(MCI_BASE_ADDR + 0x14))
#define MCI_RESP1      (*(volatile unsigned long *)(MCI_BASE_ADDR + 0x18))
#define MCI_RESP2      (*(volatile unsigned long *)(MCI_BASE_ADDR + 0x1C))
#define MCI_RESP3      (*(volatile unsigned long *)(MCI_BASE_ADDR + 0x20))
#define MCI_DATA_TMR   (*(volatile unsigned long *)(MCI_BASE_ADDR + 0x24))
#define MCI_DATA_LEN   (*(volatile unsigned long *)(MCI_BASE_ADDR + 0x28))
#define MCI_DATA_CTRL  (*(volatile unsigned long *)(MCI_BASE_ADDR + 0x2C))
#define MCI_DATA_CNT   (*(volatile unsigned long *)(MCI_BASE_ADDR + 0x30))
#define MCI_STATUS     (*(volatile unsigned long *)(MCI_BASE_ADDR + 0x34))
#define MCI_CLEAR      (*(volatile unsigned long *)(MCI_BASE_ADDR + 0x38))
#define MCI_MASK0      (*(volatile unsigned long *)(MCI_BASE_ADDR + 0x3C))
#define MCI_MASK1      (*(volatile unsigned long *)(MCI_BASE_ADDR + 0x40))
#define MCI_FIFO_CNT   (*(volatile unsigned long *)(MCI_BASE_ADDR + 0x48))
#define MCI_FIFO       (*(volatile unsigned long *)(MCI_BASE_ADDR + 0x80))
#define MCICLKEN		(*((volatile unsigned int *) 0x8000502C))

/* LCD */
#define LCDSTAT 		(*((volatile unsigned int *) 0x80103000))
#define LCDCTRL 		(*((volatile unsigned int *) 0x80103004))
#define LCDISTAT 		(*((volatile unsigned int *) 0x80103008))
#define LCDICLR 		(*((volatile unsigned int *) 0x8010300C))
#define LCDIMASK 		(*((volatile unsigned int *) 0x80103010))
#define LCDREAD 		(*((volatile unsigned int *) 0x80103014))
#define LCDIBYTE 		(*((volatile unsigned int *) 0x80103020))
#define LCDDBYTE 		(*((volatile unsigned int *) 0x80103030))
#define LCDIWORD 		(*((volatile unsigned int *) 0x80103040))
#define LCDDWORD 		(*((volatile unsigned int *) 0x80103080))

/* Port0 */
#define MODE1_0 	(*((volatile unsigned int *) 0x80003020))
#define MODE0_0 	(*((volatile unsigned int *) 0x80003010))
#define MODE1S_0 	(*((volatile unsigned int *) 0x80003024))
#define MODE0S_0 	(*((volatile unsigned int *) 0x80003014))
#define MODE1C_0 	(*((volatile unsigned int *) 0x80003028))
#define MODE0C_0 	(*((volatile unsigned int *) 0x80003018))
#define PINS_0	 	(*((volatile unsigned int *) 0x80003000))

/* Port1 */
#define MODE1_1 	(*((volatile unsigned int *) 0x80003060))
#define MODE0_1 	(*((volatile unsigned int *) 0x80003050))
#define MODE1S_1 	(*((volatile unsigned int *) 0x80003064))
#define MODE0S_1 	(*((volatile unsigned int *) 0x80003054))
#define MODE1C_1 	(*((volatile unsigned int *) 0x80003068))
#define MODE0C_1 	(*((volatile unsigned int *) 0x80003058))
#define PINS_1	 	(*((volatile unsigned int *) 0x80003040))

/* Port2 */
#define MODE1_2 	(*((volatile unsigned int *) 0x800030A0))
#define MODE0_2 	(*((volatile unsigned int *) 0x80003090))
#define MODE1S_2 	(*((volatile unsigned int *) 0x800030A4))
#define MODE0S_2 	(*((volatile unsigned int *) 0x80003094))
#define MODE1C_2 	(*((volatile unsigned int *) 0x800030A8))
#define MODE0C_2 	(*((volatile unsigned int *) 0x80003098))
#define PINS_2	 	(*((volatile unsigned int *) 0x80003080))

/* Port3 */
#define MODE1_3 	(*((volatile unsigned int *) 0x800030E0))
#define MODE0_3 	(*((volatile unsigned int *) 0x800030D0))
#define MODE1S_3 	(*((volatile unsigned int *) 0x800030E4))
#define MODE0S_3 	(*((volatile unsigned int *) 0x800030D4))
#define MODE1C_3 	(*((volatile unsigned int *) 0x800030E8))
#define MODE0C_3 	(*((volatile unsigned int *) 0x800030D8))
#define PINS_3	 	(*((volatile unsigned int *) 0x800030C0))

/* Port4 */
#define MODE1_4 	(*((volatile unsigned int *) 0x80003120))
#define MODE0_4 	(*((volatile unsigned int *) 0x80003110))
#define MODE1S_4 	(*((volatile unsigned int *) 0x80003124))
#define MODE0S_4 	(*((volatile unsigned int *) 0x80003114))
#define MODE1C_4 	(*((volatile unsigned int *) 0x80003128))
#define MODE0C_4 	(*((volatile unsigned int *) 0x80003118))
#define PINS_4	 	(*((volatile unsigned int *) 0x80003100))

/* Port5 */
#define MODE1_5 	(*((volatile unsigned int *) 0x80003160))
#define MODE0_5 	(*((volatile unsigned int *) 0x80003150))
#define MODE1S_5 	(*((volatile unsigned int *) 0x80003164))
#define MODE0S_5 	(*((volatile unsigned int *) 0x80003154))
#define MODE1C_5 	(*((volatile unsigned int *) 0x80003168))
#define MODE0C_5 	(*((volatile unsigned int *) 0x80003158))
#define PINS_5	 	(*((volatile unsigned int *) 0x80003140))

/* Port6 */
#define MODE1_6 	(*((volatile unsigned int *) 0x800031A0))
#define MODE0_6 	(*((volatile unsigned int *) 0x80003190))
#define MODE1S_6 	(*((volatile unsigned int *) 0x800031A4))
#define MODE0S_6 	(*((volatile unsigned int *) 0x80003194))
#define MODE1C_6 	(*((volatile unsigned int *) 0x800031A8))
#define MODE0C_6 	(*((volatile unsigned int *) 0x80003198))
#define PINS_6 		(*((volatile unsigned int *) 0x80003180))

/* Port7 */
#define MODE1_7 	(*((volatile unsigned int *) 0x800031E0))
#define MODE0_7 	(*((volatile unsigned int *) 0x800031D0))
#define MODE1S_7 	(*((volatile unsigned int *) 0x800031E4))
#define MODE0S_7 	(*((volatile unsigned int *) 0x800031D4))
#define MODE1C_7 	(*((volatile unsigned int *) 0x800031E8))
#define MODE0C_7 	(*((volatile unsigned int *) 0x800031D8))
#define PINS_7	 	(*((volatile unsigned int *) 0x800031C0))

#endif

